# CLI tools
brew "awscli"
brew "bash"
brew "bat"
brew "btop"
brew "clang-format"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "eza"
brew "fish"
brew "git"
brew "git-lfs"
brew "go-task"
brew "hyperfine"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lua-language-server"
brew "mackup"
brew "mas"
brew "media-info"
brew "node"
brew "npm"
brew "openjdk"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "stylua"
brew "tldr"
brew "uv"
brew "wget"

# Casks
cask "1password"
cask "1password-cli"
cask "airfoil"
cask "aldente"
cask "amethyst"
cask "appcleaner"
cask "bartender"
cask "betterdisplay"
cask "brave-browser"
cask "cameracontroller"
cask "cyberduck"
cask "claude"
cask "claude-code"
cask "datagrip"
cask "defold"
cask "discord"
cask "eurkey"
cask "flux"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake-app"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "jdownloader"
cask "kap"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "logi-options+"
cask "macs-fan-control"
cask "mkvtoolnix-app"
cask "mullvad-browser"
cask "proton-mail-bridge"
cask "protonvpn"
cask "raycast"
cask "shottr"
cask "slack"
cask "spaceid"
cask "spotify"
cask "steam"
cask "telegram"
cask "time-out"
cask "vial"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoom"

# Mac App Store
mas "1Password for Safari", id: 1569813296
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spotica Menu", id: 570549457
mas "Xcode", id: 497799835
